Revit 2027 API
ColumnAttachmentJustification Enumeration
 Control the column extent in cases where the target is not a uniform height.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ColumnAttachmentJustification
Public Enumeration ColumnAttachmentJustification
public enum class ColumnAttachmentJustification
type ColumnAttachmentJustification
Members
Member name | Value | Description
Maximum | 2 |  Extend the column until it is completely covered by the target, intersecting it if necessary.
Midpoint | 1 |  Extend the column until its midpoint contacts the target.
Minimum | 0 |  Minimize the column extent, so that it comes in contact with the target but does not intersect.
Tangent | 3 |  For slanted columns only. Extend the column until its driving curve contacts the target, then cut the column with a plane tangent to the target at that contact point.
See Also
Reference
Autodesk.Revit.DB Namespace